# DATA 1 Practical 6

Simos Gerasimou


## A Data Journey Through The Titanic

On April 15, 1912, during her maiden voyage from Southampton to New York, the widely considered “unsinkable” RMS Titanic sank after colliding with an iceberg ([Wikipedia](https://en.wikipedia.org/wiki/RMS_Titanic)). As it was considered “unsinkable”, the Titanic did not carry enough lifeboats for everyone onboard, resulting in the death of 1502 out of 2224 passengers and crew.

**DataVision** has been commissioned by Her Majesty The Queen to investigate the conditions in which people survived and whether this was because of luck or whether some groups were more likely to survive than others. If discrimination due to gender or socio-economic class is identified, the Queen intends to use this information to change the cruise policies accordinly. 

#### Your tasks are to explore this dataset and generade some actionable knowledge. 


#### This Jupyter Notebook will be presented to  the House of Commons  who have limited knowledge about data science. So, your findings should be complemented by a suitable justification explaining what you observe and, when applicable, what does this observation  mean and, possibly, why it occurs.

* For each question (task) a description is provided accompanied (most of the time) by two cells: one for writing the Python code and another for providing the justification. Feel free to add more cells if you feel they are needed, but keep the cells corresponding to the same question close by.

#### Note: You are advised to use Pandas. For the visualisation, you can use Pandas, Matplotlib or Seaborn.

To answer these exercises, you should first read:

(1)  Chapter 3: Dapa Manipulation with Pandas from the Python Data Science Handbook** (https://jakevdp.github.io/PythonDataScienceHandbook/03.00-introduction-to-pandas.html)

(2) Chapter 4: Visualization with Matplotlib (https://jakevdp.github.io/PythonDataScienceHandbook/04.00-introduction-to-matplotlib.html)



* Seaborn API: https://seaborn.pydata.org/api.html

***

### Part 1: Reading dataset


The Titanic dataset is available on VLE (look for titanicFull.csv in the Practicals section)

Before doing the tasks below, you may want to explore the dataset using a spreadsheet editor (e.g., Excel) to get a high-level view of the dataset.

**T1) Load the Titanic dataset using Pandas**

**Note**: You have to download the dataset on your local machine and then load it onto the Jupyter Notebook

In [107]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

#Write your answer here
df = pd.read_csv('titanicFull.csv')
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S

***

### Part 2: Cleaning the dataset

**T2i) Print the first 4 records of the dataset**

In [108]:
#Write your answer here
df.head(4)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S

**T2ii) Print the last 6 records of the dataset**

In [109]:
#Write your answer here
df.tail(6)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S

**T3) Get general info about the dataset**

In [110]:
#Write your answer here
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   survived  1309 non-null   int64
 2   name      1309 non-null   object
 3   sex       1309 non-null   object
 4   age       1046 non-null   float64
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   ticket    1309 non-null   object
 8   fare      1308 non-null   float64
 9   cabin     295 non-null    object
 10  embarked  1307 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

**T4) Explore the dataset and try to understand the meaning of each variable (column). Identify which variables are categorical and which are numerical.**

**Note**: Inferring the meaning of variables 'Pclass', 'SibSp', 'Parch' could be challenging; think of what is missing from the dataset and what types of people were travelling on the Titanic. If you find it more difficult, the answer is at the end of this notebook

In [111]:
#Write your answer here
df.columns.to_list()

['pclass',
 'survived',
 'name',
 'sex',
 'age',
 'sibsp',
 'parch',
 'ticket',
 'fare',
 'cabin',
 'embarked']

**T5) Get the shape of the dataframe**

In [112]:
#Write your answer here
df.shape

(1309, 11)

**T6) Get the name of the columns for the dataframe**

In [113]:
#Write your answer here
df.columns.to_list()

['pclass',
 'survived',
 'name',
 'sex',
 'age',
 'sibsp',
 'parch',
 'ticket',
 'fare',
 'cabin',
 'embarked']

**T7) Do you think the columns (variables) need to be more readable? In particular, those that you might have found difficult to understand in T4**

In [114]:
#Write your answer here

**T8) Are there any duplicated records?**

In [115]:
#Write your answer here
len(df[df.duplicated()])

0

**T9) Copy the dataset so that you manipulate the copied dataset and leave the original unaffected**

**Hint**: Check the pandas documentation for help on how to copy the dataframe

In [116]:
#Write your answer here
_df = df.drop_duplicates()

**T10) Create a new dataframe in which**
* **a Missing variable (column) indicates the number of missing data for each variable in the titanic dataset**
* **a Percentage variable indicates the percentage of the missing data over the size of the titanic dataset**

**Print the records in this new dataframe sorted in descending order**

In [117]:
#Write your answer here


missingData = pd.concat([_df.isna().sum(), (_df.isnull().sum())/_df.shape[0]], axis=1 , keys=['Missing', 'Percentage'])
missingData.sort_values(ascending=False, by="Missing")

          Missing  Percentage
cabin        1014    0.774637
age           263    0.200917
embarked        2    0.001528
fare            1    0.000764
pclass          0    0.000000
survived        0    0.000000
name            0    0.000000
sex             0    0.000000
sibsp           0    0.000000
parch           0    0.000000
ticket          0    0.000000

**T11) What should we do with the variable with the highest number of missing data. Consider the amount of missing data compared to the total number of available data.**

In [118]:
#Write your answer here
_df.drop(columns=['cabin'], inplace=True)
_df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,S
...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,C
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,S

**T12) Impute the categorical variable (just one) with the mode value**

In [119]:
#Write your answer here

**T13i) Plot the histogram of the numeric variable with the largest number of missing data so as to determine the best value to fill in the missing data. Add suitable title and axis names.**

**Note: You may want to use the native Pandas visualisation, matplotlib or seaborn**

**Hint**: Check the relevant section from the Python Data Science Handbook (https://jakevdp.github.io/PythonDataScienceHandbook/04.05-histograms-and-binnings.html) or the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.plot.hist.html)

In [120]:
#Write your answer here

**T13ii) Impute the numeric variable (just one) with an appropriate value**

* What value does it make sense to impute for this variable?

In [121]:
#Write your answer here

**T13iii) Plot the histogram again for the variable from task T13 after imputation and observe how the distribution has changed.**

In [122]:
#Write your answer here

**T14) What should you do about the missing value (one) of the final variable? Select the best imputation strategy and apply it**

**Hint:** You may want to consider additional factors and use a more sophisticated imputation strategy

In [123]:
#Write your answer here

**T15i) Save the cleaned dataframe as a csv file with name "titanicClean.csv"**

**Hint: Check the Pandas to_csv function**

In [124]:
#Write your answer here

**T15ii) Load the cleaned dataset into a new dataframe**

In [125]:
#Write your answer here

***

### Part 3: Analysing the dataset

**T16) Get some descriptive statistics for the dataset selecting only the variables for which the descriptive statistics make sense**

In [126]:
#Write your answer here

**T17i) For each passenger, find out how many family members she/he has in total and store this information as a new variable in the dataframe**

In [127]:
#Write your answer here

**T17ii) Print the records for the family with surname "Palsson" and confirm that the result from task T17i is correct**

In [128]:
#Write your answer here

**T18): Find out and print the details of the biggest family on board**

**Hint: You may want to check https://en.wikipedia.org/wiki/Passengers_of_the_Titanic or https://titanicfacts.net/titanic-passenger-list**

Also read: https://en.wikipedia.org/wiki/Passengers_of_the_Titanic#Third_class

In [129]:
#Write your answer here

**T19i) How was the ticket fare for class 1 distributed? Generate a boxplot and investigate whether there are any interesting insights**

**Hint**: You may want to check: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.boxplot.html

In [130]:
#Write your answer here

**T19ii) Do you see any weird fare values? Check if there are any outliers for the ticket fares of class 1 using the standard deviation method.**

In [131]:
#Write your answer here

**T19iii) Print the information for those passengers**

You can read the interesting story of the passengers and their families at:
- https://www.encyclopedia-titanica.org/titanic-survivor/charlotte-cardeza.html
- https://www.encyclopedia-titanica.org/titanic-survivor/annie-moore-ward.html

In [132]:
#Write your answer here

**T20) Given that Titanic stopped in three ports (C = Cherbourg, Q = Queenstown, S = Southampton) before departing from the UK, can we identify any patterns regarding the ports at which passengers embarked on the Titanic? Produce a bar plot to illustrate this**

**Hint:** You may want to check: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.plot.bar.html

In [133]:
#Write your answer here

### Brain Teaser
**Generate a new column 'Title' that includes the title of each passenger and has only the following entries:**
* Master, Miss, Mr, Mss 

where
* Miss includes also Mlle and Ms
* Mme includes also Mrs
* all the remaining titles become Rare

In [134]:
#Write your answer here

In [135]:
# Answers to T4
# - Pclass     Ticket class	     
# - SibSp      # of siblings/spouses aboard the Titanic
# - Parch      # of parents / children aboard the Titanic